# ScaledWidth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCreationData..::..ScaledWidth Property
IFCExtrusionCreationData Class See Also
---
The width of the extrusion, scaled to the units of export.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double ScaledWidth { get; set; }
```

Visual Basic
---
```text
Public Property ScaledWidth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double ScaledWidth {
	double get ();
	void set (double value);
}
```

# ### Field Value
Zero if the width has never been set on this object.
# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace